import React from "react";
import "./AboutPage.css"; // стилі знизу додай у окремий CSS-файл

const AboutPage = () => {
  return (
    <div className="container">
        <div className="about">
            <h1 className="about__title">Про нас</h1>

            <p className="about__text">
                <strong>FlightTickets</strong> — це сучасний вебсервіс для зручного
                бронювання авіаквитків. Проєкт створив Марчук Богдан — студент,
                захоплений веброзробкою та прагненням покращити взаємодію людей з
                цифровими сервісами.
            </p>

            <p className="about__text">
                Спершу платформа виникла як навчальний проєкт у рамках лабораторних
                робіт. Та з часом ідея можливо трансформується у щось більше — у повноцінну
                систему, яка імітуватиме реальні процеси бронювання авіарейсів, зручного
                вибору місць і керування рейсами.
            </p>

            <hr/>

            <h2>Місія проекту</h2>
            <p className="about__text">
                Створюючи проект, я прагнув зробити досвід бронювання квитків максимально простим,
                зрозумілим і доступним. Навіть якщо це прототип, я вірю, що зручність
                — це ключ до ефективних рішень.
            </p>
            
            <hr/>

            <h2 className="about__mini-title">Цінності</h2>
            <ul>
                <li className="about__text"><strong>Простота:</strong> Мінімум кроків — максимум результату.</li>
                <li className="about__text"><strong>Якість:</strong> Навіть студентський код може бути професійним.</li>
                <li className="about__text"><strong>Навчання:</strong> Кожен рядок коду — це крок до майстерності.</li>
                <li className="about__text"><strong>Користувач у центрі:</strong> Усе, що створюється — для людей.</li>
            </ul>

            <p className="about__text">
                Дякую, що завітали. Можливо продовжу розвивати платформу,
                вдосконалюючи як її функціонал, так і власні навички.
            </p>
        </div>
    
    </div>
  );
};

export default AboutPage;
